In [6]:
#create the date frame with Random number
import pandas as pd
import numpy as np
series = np.random.rand(5)

In [7]:
series

array([0.62377965, 0.13450513, 0.10038514, 0.73657055, 0.26053346])

In [12]:
df1= pd.DataFrame(series)

In [13]:
df1

          0
0  0.623780
1  0.134505
2  0.100385
3  0.736571
4  0.260533

In [54]:
df2 = pd.DataFrame({'Name': ['Kalpesh','Yogesh','Arpita','Pandharinath','Vimal']})

In [55]:
#inserting new column in DataFrame
df2.insert(1,'Age',[30,22,26,56,46],True) #inserting new values to the Dataframe

In [56]:
df2["Occupation"] = ["MasterCard","Contract","HouseWifr","Teacher","HouseWife"]

In [57]:
df2

           Name  Age  Occupation
0       Kalpesh   30  MasterCard
1        Yogesh   22    Contract
2        Arpita   26   HouseWifr
3  Pandharinath   56     Teacher
4         Vimal   46   HouseWife

In [58]:
# Getting column Names in DataFrame

In [59]:
for X in df2.columns :
    print (X)

Name
Age
Occupation

In [60]:
#method 2

In [61]:
list(df2.columns)

['Name', 'Age', 'Occupation']

In [39]:
#Getting Indexes from DataFrames

In [42]:
#Method1:
list(df2.index)

[0, 1, 2, 3, 4]

In [62]:
#Method 2:
for y in df2.index:
    print (y)

0
1
2
3
4

In [63]:
#inserting new Row in DataFrame
df2

           Name  Age  Occupation
0       Kalpesh   30  MasterCard
1        Yogesh   22    Contract
2        Arpita   26   HouseWifr
3  Pandharinath   56     Teacher
4         Vimal   46   HouseWife

In [82]:
df3=pd.DataFrame({"Name":['Hritvi']})

In [86]:
df3["Age"] = '0'

In [88]:
df3["Occupation"]="Child"

In [89]:
df3

     Name Age Occupation
0  Hritvi   0      Child

In [91]:
df2.append(df3,ignore_index=True)

           Name Age  Occupation
0       Kalpesh  30  MasterCard
1        Yogesh  22    Contract
2        Arpita  26   HouseWifr
3  Pandharinath  56     Teacher
4         Vimal  46   HouseWife
5        Hritvi   0       Child

In [95]:
df2.loc[0,'Name']

'Kalpesh'

In [99]:
df2.loc[df2['Age'] ==30,"Name"]

0    Kalpesh
Name: Name, dtype: object